app/views/users/show.html.erb

  <h2>Your friend requests:</h2>
  <% @user.friend_requests.each do |request| %>
---
SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."user_id" = ?  [["user_id", 8]]