app/views/users/show.html.erb

  <h2>Your friends:</h2>
  <% @user.users.each do |friend| %>
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

  <%= link_to 'Destroy', @user, method: :delete, data: { confirm: 'Are you sure?' } %> |
<% elsif !@session_user.users.include?(@user) %>
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]