app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "PIZZA"], ["content", "I'm a mario, and I a like a mah pizza"], ["created_at", "2019-09-24 19:08:00.038752"], ["updated_at", "2019-09-24 19:08:00.038752"], ["user_id", 3]]
---
  def create
    @post = Post.new(post_params.merge(user_id: session[:user_id]))
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "labs are tedious sometimes."], ["updated_at", "2019-09-24 18:55:19.331966"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def get_user
      @user = User.find(session[:user_id])