app/controllers/sessions_controller.rb

  def create
    user = User.find_by_user_name(params[:user_name])
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "ashwinkannan"], ["LIMIT", 1]]