app/controllers/users_controller.rb

  def show
    @feed_posts = (@user.friends.map{|u| u.posts}.flatten + @user.posts)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "user_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$o9PXvQ1yRU0L5ZJpY3zk6ebILEaWPIFcVQ7AdkkFZUD4r.dQWjEXi"], ["updated_at", "2019-09-24 19:01:44.949231"], ["id", 2]]

  def destroy
    if @user.id != session[:user_id]
      redirect_to @session_user, notice: 'Delete failed, unauthorized access.'
    else
      @user.posts.each {|p| p.destroy}
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]

  def send_friend_request
    FriendRequest.create(sender_id: @session_user.id, user_id: @user.id)
---
INSERT INTO "friends" ("user_a_id", "user_b_id") VALUES (?, ?)  [["user_a_id", 6], ["user_b_id", 4]]
INSERT INTO "friend_requests" ("sender_id", "user_id") VALUES (?, ?)  [["sender_id", 6], ["user_id", 7]]

  def accept_friend_request
    sender = User.find(params[:sender_id])
    @session_user.friends << sender
    sender.friends << @session_user
    FriendRequest.find_by(sender_id: params[:sender_id]).destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "friends" ("user_a_id", "user_b_id") VALUES (?, ?)  [["user_a_id", 8], ["user_b_id", 6]]
INSERT INTO "friends" ("user_a_id", "user_b_id") VALUES (?, ?)  [["user_a_id", 6], ["user_b_id", 8]]
DELETE FROM "friend_requests" WHERE "friend_requests"."id" = ?  [["id", 2]]

    def set_session_user
      if session[:user_id]
        @session_user ||= User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]